<!DOCTYPE html>
<html lang="fr">
<head>
    <meta charset="UTF-8">
    <link rel="icon" type="image/svg+xml" href="favicon.svg">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>WindMar - Trois problèmes ouverts du routage météorologique en marine marchande</title>
    <link rel="stylesheet" href="assets/css/docs.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.11/dist/katex.min.css">
    <script defer src="https://cdn.jsdelivr.net/npm/katex@0.16.11/dist/katex.min.js"></script>
    <script defer src="https://cdn.jsdelivr.net/npm/katex@0.16.11/dist/contrib/auto-render.min.js"></script>
</head>
<body>

<!-- Header -->
<header class="docs-header">
    <div class="docs-header-content">
        <a href="docs.html" class="docs-logo">
            <i class="fas fa-ship"></i>
            <span>WindMar</span>
        </a>
        <nav>
            <ul class="docs-nav">
                <li><a href="docs.html">Documentation</a></li>
                <li class="docs-nav-dropdown">
                    <a href="#">Technical Articles <i class="fas fa-caret-down"></i></a>
                    <ul class="docs-nav-dropdown-menu">
                        <li><a href="weather-fields.html">Weather Fields</a></li>
                        <li><a href="data-pipeline.html">Data Pipeline</a></li>
                        <li><a href="hydrodynamics.html">Hydrodynamics &amp; RAO</a></li>
                        <li><a href="astar-pathfinding.html">A* Pathfinding</a></li>
                        <li><a href="route-optimization-engines.html">Optimization Engines</a></li>
                        <li><a href="weather-data.html">Weather Acquisition</a></li>
                        <li><a href="monte-carlo.html">Monte Carlo</a></li>
                        <li><a href="open-problems.html" class="active">Open Problems</a></li>
                    </ul>
                </li>
                <li><a href="https://github.com/windmar-nav/windmar" target="_blank"><i class="fab fa-github"></i> GitHub</a></li>
            </ul>
        </nav>
        <a href="https://slmar.co" class="back-to-main"><i class="fas fa-arrow-left"></i> Back to Main Site</a>
    </div>
</header>

<!-- Main Layout -->
<div class="docs-container">

    <!-- Sidebar -->
    <aside class="docs-sidebar">

        <div class="sidebar-section">
            <div class="sidebar-title">Article</div>
            <ul class="sidebar-menu">
                <li><a href="#abstract"><i class="fas fa-file-alt"></i> R&eacute;sum&eacute;</a></li>
                <li><a href="#introduction"><i class="fas fa-book-open"></i> Introduction</a></li>
            </ul>
        </div>

        <div class="sidebar-section">
            <div class="sidebar-title">Probl&egrave;me 1</div>
            <ul class="sidebar-menu">
                <li><a href="#p1-diagnostic"><i class="fas fa-cloud-sun"></i> Diagnostic</a></li>
                <li><a href="#p1-wasserstein"><i class="fas fa-exchange-alt"></i> Distance de Wasserstein</a></li>
                <li><a href="#p1-pipeline"><i class="fas fa-filter"></i> Pipeline &amp; Clustering</a></li>
                <li><a href="#p1-monte-carlo"><i class="fas fa-dice"></i> Monte Carlo conditionnel</a></li>
            </ul>
        </div>

        <div class="sidebar-section">
            <div class="sidebar-title">Probl&egrave;me 2</div>
            <ul class="sidebar-menu">
                <li><a href="#p2-diagnostic"><i class="fas fa-water"></i> Diagnostic</a></li>
                <li><a href="#p2-spectre"><i class="fas fa-wave-square"></i> Reconstitution spectrale</a></li>
                <li><a href="#p2-calibration"><i class="fas fa-sliders-h"></i> Calibration</a></li>
            </ul>
        </div>

        <div class="sidebar-section">
            <div class="sidebar-title">Probl&egrave;me 3</div>
            <ul class="sidebar-menu">
                <li><a href="#p3-diagnostic"><i class="fas fa-route"></i> Diagnostic</a></li>
                <li><a href="#p3-pareto"><i class="fas fa-chart-line"></i> &Eacute;chec de Pareto</a></li>
                <li><a href="#p3-splines"><i class="fas fa-bezier-curve"></i> Splines contraintes</a></li>
            </ul>
        </div>

        <div class="sidebar-section">
            <div class="sidebar-title">Synth&egrave;se</div>
            <ul class="sidebar-menu">
                <li><a href="#articulation"><i class="fas fa-project-diagram"></i> Articulation</a></li>
                <li><a href="#discussion"><i class="fas fa-comments"></i> Discussion</a></li>
                <li><a href="#conclusion"><i class="fas fa-flag-checkered"></i> Conclusion</a></li>
            </ul>
        </div>

        <div class="sidebar-section">
            <div class="sidebar-title">Resources</div>
            <ul class="sidebar-menu">
                <li><a href="#references"><i class="fas fa-bookmark"></i> R&eacute;f&eacute;rences</a></li>
                <li><a href="docs.html"><i class="fas fa-arrow-left"></i> Back to Docs</a></li>
                <li><a href="https://github.com/windmar-nav/windmar" target="_blank"><i class="fab fa-github"></i> GitHub</a></li>
            </ul>
        </div>

    </aside>

    <!-- Main Content -->
    <main class="docs-main">
        <div class="docs-content">

            <!-- ============================================================ -->
            <!-- ABSTRACT -->
            <!-- ============================================================ -->
            <section id="abstract">
                <h1>Trois probl&egrave;mes ouverts du routage m&eacute;t&eacute;orologique en marine marchande</h1>
                <p class="docs-subtitle">Sc&eacute;narios climatologiques, calibration spectrale et instabilit&eacute; des trajectoires optimales</p>

                <div class="alert info" style="margin-top: 1rem; margin-bottom: 1.5rem; font-size: 0.92rem; line-height: 1.6;">
                    <strong><i class="fas fa-user"></i> S&eacute;bastien Laignel</strong><br>
                    Capitaine illimit&eacute; de la marine marchande &mdash; SL Mar &ndash; Marine Consultancy<br>
                    <em>Correspondance :</em> smr.laignel@gmail.com
                </div>

                <div class="alert info">
                    <strong><i class="fas fa-info-circle"></i> Article technique</strong><br>
                    Cet article identifie trois probl&egrave;mes fondamentaux du routage m&eacute;t&eacute;orologique en marine marchande
                    et propose des approches pour chacun. Il s&rsquo;inscrit dans le cadre de recherche du projet WindMar et
                    d&eacute;finit la feuille de route th&eacute;orique pour les versions futures du syst&egrave;me.
                </div>

                <h3>R&eacute;sum&eacute;</h3>
                <p>
                    L&rsquo;optimisation de routes m&eacute;t&eacute;orologiques en marine marchande repose sur trois hypoth&egrave;ses
                    rarement questionn&eacute;es : que les pr&eacute;visions m&eacute;t&eacute;orologiques constituent une entr&eacute;e suffisante
                    pour l&rsquo;optimisation, que le mod&egrave;le de performance du navire est fiable, et que l&rsquo;espace des
                    trajectoires possibles admet une structure exploitable par les m&eacute;thodes d&rsquo;optimisation classiques.
                    Cet article montre que ces trois hypoth&egrave;ses sont probl&eacute;matiques et propose des approches pour chacune.
                </p>
                <p>
                    Le premier probl&egrave;me &mdash; l&rsquo;inad&eacute;quation des pr&eacute;visions climatologiques g&eacute;n&eacute;riques &mdash;
                    est trait&eacute; par la s&eacute;lection d&rsquo;analogues historiques dans les r&eacute;analyses ERA5, mesur&eacute;s par
                    distance de Wasserstein spatio-temporelle et organis&eacute;s par clustering en sc&eacute;narios physiquement
                    coh&eacute;rents, puis explor&eacute;s par simulations de Monte Carlo param&eacute;triques conditionnelles pour
                    produire des distributions de consommation.
                </p>
                <p>
                    Le deuxi&egrave;me &mdash; l&rsquo;&eacute;cart entre le mod&egrave;le hydrodynamique et le comportement r&eacute;el du navire
                    &mdash; est trait&eacute; par la reconstitution du spectre directionnel de vagues en route, dont les
                    descripteurs calibrent les param&egrave;tres de r&eacute;sistance ajout&eacute;e et de perte de vitesse.
                </p>
                <p>
                    Le troisi&egrave;me &mdash; l&rsquo;instabilit&eacute; des solutions dans l&rsquo;espace des trajectoires stochastiques
                    &mdash; est trait&eacute; par une param&eacute;trisation des routes en courbes spline contraintes dans un couloir
                    &agrave; d&eacute;croissance exponentielle.
                </p>
                <p>
                    L&rsquo;objectif n&rsquo;est pas d&rsquo;automatiser la d&eacute;cision de route, mais de fournir aux navigateurs
                    les outils d&rsquo;analyse n&eacute;cessaires pour qu&rsquo;ils effectuent eux-m&ecirc;mes des arbitrages &eacute;clair&eacute;s.
                </p>

                <p style="font-size: 0.88rem; color: #6b7280; margin-top: 1.5rem;">
                    <strong>Mots-cl&eacute;s :</strong> routage m&eacute;t&eacute;orologique, distance de Wasserstein, ensembles analogues,
                    Monte Carlo param&eacute;trique, spectre de vagues, calibration hydrodynamique, splines contraintes,
                    aide &agrave; la d&eacute;cision maritime.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 1. INTRODUCTION -->
            <!-- ============================================================ -->
            <section id="introduction">
                <h2><i class="fas fa-book-open"></i> 1. Introduction</h2>

                <p>
                    Le routage m&eacute;t&eacute;orologique promet des &eacute;conomies de carburant de l&rsquo;ordre de 3 &agrave; 5 % en
                    moyenne pour la marine marchande [1, 3], avec des cas pouvant atteindre 7 &agrave; 10 % dans des
                    conditions favorables. Ces chiffres, coh&eacute;rents entre les &eacute;tudes acad&eacute;miques et les analyses
                    de flotte [2], justifient l&rsquo;int&eacute;r&ecirc;t croissant des armateurs et des r&eacute;gulateurs pour ces
                    syst&egrave;mes, en particulier dans le contexte des indicateurs CII et EEXI.
                </p>
                <p>
                    Cependant, la pratique op&eacute;rationnelle du routage r&eacute;v&egrave;le trois probl&egrave;mes fondamentaux que
                    les syst&egrave;mes commerciaux ne traitent pas &mdash; ou traitent implicitement, sans en exposer les
                    cons&eacute;quences. Ces trois probl&egrave;mes concernent respectivement l&rsquo;entr&eacute;e m&eacute;t&eacute;orologique, le
                    mod&egrave;le de performance du navire et la structure de l&rsquo;espace d&rsquo;optimisation.
                </p>
                <p>
                    <strong>Le premier probl&egrave;me</strong> est celui de la pertinence des sc&eacute;narios m&eacute;t&eacute;orologiques
                    utilis&eacute;s. Les syst&egrave;mes actuels fonctionnent soit sur une pr&eacute;vision d&eacute;terministe unique, soit
                    sur les membres d&rsquo;un ensemble num&eacute;rique (ECMWF ENS, GEFS). Dans le premier cas, on optimise
                    sur un sc&eacute;nario qui ne se r&eacute;alisera pas. Dans le second, les membres sont trop peu nombreux
                    (31 &agrave; 51) pour estimer les queues de distribution, et ne garantissent pas la coh&eacute;rence
                    physique entre variables. Dans les deux cas, l&rsquo;optimiseur travaille avec une repr&eacute;sentation
                    pauvre de l&rsquo;espace des situations m&eacute;t&eacute;orologiques possibles.
                </p>
                <p>
                    <strong>Le deuxi&egrave;me probl&egrave;me</strong> est celui de la fid&eacute;lit&eacute; du mod&egrave;le navire. Les courbes
                    de r&eacute;sistance ajout&eacute;e et de perte de vitesse en vagues sont issues de formulations
                    semi-empiriques (Stawave, Liu&ndash;Papanikolaou) calibr&eacute;es sur des conditions id&eacute;alis&eacute;es.
                    En conditions r&eacute;elles &mdash; houle crois&eacute;e, spectre multi-pic, fouling, conditions de chargement
                    variables &mdash;, l&rsquo;&eacute;cart mod&egrave;le&ndash;r&eacute;alit&eacute; peut atteindre le m&ecirc;me ordre de grandeur que le
                    gain attendu du routage. Pour r&eacute;duire cet &eacute;cart, il faut injecter dans le mod&egrave;le le spectre
                    de mer r&eacute;ellement rencontr&eacute;, ce qui suppose de le reconstituer &agrave; partir des mesures
                    disponibles &agrave; bord.
                </p>
                <p>
                    <strong>Le troisi&egrave;me probl&egrave;me</strong> est celui de la structure de l&rsquo;espace d&rsquo;optimisation.
                    L&rsquo;espace des trajectoires stochastiques &mdash; l&rsquo;ensemble des chemins possibles dans un champ de
                    co&ucirc;ts al&eacute;atoire &mdash; est d&eacute;pourvu de structure r&eacute;guli&egrave;re. Une optimisation multi-objectif
                    de type Pareto dans cet espace produit des fronts fragment&eacute;s et des sauts topologiques entre
                    solutions voisines, incompatibles avec l&rsquo;exploitation op&eacute;rationnelle.
                </p>
                <p>
                    Le pr&eacute;sent article analyse ces trois probl&egrave;mes et propose pour chacun une approche : la
                    s&eacute;lection d&rsquo;analogues m&eacute;t&eacute;orologiques par distance de Wasserstein et clustering
                    (probl&egrave;me 1), la calibration du mod&egrave;le hydrodynamique par reconstitution spectrale
                    (probl&egrave;me 2), et la param&eacute;trisation des routes par splines contraintes &agrave; enveloppe
                    exponentielle (probl&egrave;me 3). L&rsquo;objectif n&rsquo;est pas de construire un syst&egrave;me de routage
                    automatique, mais de fournir aux marins les moyens d&rsquo;analyse pouss&eacute;s pour qu&rsquo;ils r&eacute;alisent
                    eux-m&ecirc;mes les arbitrages.
                </p>

                <h3>1.1 &Eacute;tat actuel de l&rsquo;impl&eacute;mentation (WindMar v0.0.6)</h3>
                <p>
                    Les approches propos&eacute;es dans cet article constituent une feuille de route th&eacute;orique.
                    Le syst&egrave;me WindMar, dans sa version actuelle (v0.0.6), impl&eacute;mente un pipeline
                    op&eacute;rationnel qui couvre d&eacute;j&agrave; une partie de la cha&icirc;ne, mais avec des m&eacute;thodes plus
                    simples que celles propos&eacute;es ici. Il est important de situer pr&eacute;cis&eacute;ment ce qui
                    existe pour comprendre ce que les trois probl&egrave;mes ouverts ajouteraient.
                </p>

                <table>
                    <thead>
                        <tr>
                            <th>Axe</th>
                            <th>Cet article propose</th>
                            <th>WindMar v0.0.6 impl&eacute;mente</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td><strong>Sc&eacute;narios m&eacute;t&eacute;o</strong><br><em>(probl&egrave;me 1)</em></td>
                            <td>S&eacute;lection d&rsquo;analogues ERA5 par distance de Wasserstein spatio-temporelle, clustering en 3&ndash;5 sc&eacute;narios nomm&eacute;s, Monte Carlo conditionnel (N = 1 000&ndash;10 000)</td>
                            <td>Pr&eacute;vision d&eacute;terministe unique (NOAA GFS 0,25&deg;, 5 jours), pr&eacute;-ing&eacute;r&eacute;e dans PostgreSQL sur un cycle de 6 heures. Simulation de Monte Carlo param&eacute;trique (N = 100) avec perturbations corr&eacute;l&eacute;es temporellement (d&eacute;composition de Cholesky), mais appliqu&eacute;es autour de la pr&eacute;vision GFS unique &mdash; pas de recherche d&rsquo;analogues, pas de clustering</td>
                        </tr>
                        <tr>
                            <td><strong>Mod&egrave;le navire</strong><br><em>(probl&egrave;me 2)</em></td>
                            <td>Reconstitution du spectre directionnel \(S(f, \theta)\) &agrave; partir de capteurs embarqu&eacute;s, calibration des param&egrave;tres de r&eacute;sistance par partition spectrale</td>
                            <td>Mod&egrave;le Holtrop&ndash;Mennen avec param&egrave;tres scalaires d&rsquo;&eacute;tat de mer (\(H_s\), \(T_p\), direction) issus des grilles de pr&eacute;vision. Calibration par moindres carr&eacute;s non lin&eacute;aires (scipy) &agrave; partir de rapports de midi (noon reports). Pas de reconstitution spectrale</td>
                        </tr>
                        <tr>
                            <td><strong>Trajectoires</strong><br><em>(probl&egrave;me 3)</em></td>
                            <td>Param&eacute;trisation par B-splines cubiques (\(N_c\) = 4&ndash;8 points de contr&ocirc;le) dans un couloir &agrave; d&eacute;croissance exponentielle \(\Delta_0 e^{-t/\tau}\), avec r&eacute;-optimisation MPC</td>
                            <td>Recherche A* sur grille oc&eacute;anique 8-connect&eacute;e (r&eacute;solution 0,5&deg;), lissage Douglas-Peucker + filtre d&rsquo;angle de giration (&lt; 15&deg;). Deux strat&eacute;gies de vitesse pr&eacute;sent&eacute;es apr&egrave;s optimisation (&laquo; Same Speed &raquo; / &laquo; Match ETA &raquo;). Pas de param&eacute;trisation spline, pas de couloir contraint</td>
                        </tr>
                    </tbody>
                </table>

                <p>
                    Les deux captures d&rsquo;&eacute;cran ci-dessous illustrent l&rsquo;&eacute;tat actuel du syst&egrave;me. La route
                    originale (trac&eacute; bleu) et la route optimis&eacute;e par A* (trac&eacute; vert pointill&eacute;) sont
                    affich&eacute;es simultan&eacute;ment sur la carte. Le panneau de comparaison (en bas &agrave; gauche)
                    pr&eacute;sente deux onglets de strat&eacute;gie de vitesse &mdash; &laquo; Same Speed &raquo; et
                    &laquo; Match ETA &raquo; &mdash; avec les &eacute;conomies de carburant et de temps associ&eacute;es.
                </p>

                <figure style="margin: 1.5rem 0;">
                    <img src="assets/img/windmar-dual-route-wind.png" alt="WindMar v0.0.6 — Optimisation A* avec superposition du champ de vent GFS" style="width: 100%; border-radius: 8px; border: 1px solid var(--ib-border);">
                    <figcaption style="font-size: 0.85rem; color: #6b7280; margin-top: 0.5rem; text-align: center;">
                        <strong>Figure 1.</strong> Route originale (bleu) et route optimis&eacute;e A* (vert pointill&eacute;) sur fond de champ de vent GFS anim&eacute;. Le panneau de comparaison montre les onglets &laquo; Same Speed &raquo; / &laquo; Match ETA &raquo; avec les &eacute;conomies de carburant et de temps par rapport au calcul de voyage de r&eacute;f&eacute;rence.
                    </figcaption>
                </figure>

                <figure style="margin: 1.5rem 0;">
                    <img src="assets/img/windmar-dual-route-ecdis.png" alt="WindMar v0.0.6 — Interface ECDIS avec double affichage de route et crêtes de vagues" style="width: 100%; border-radius: 8px; border: 1px solid var(--ib-border);">
                    <figcaption style="font-size: 0.85rem; color: #6b7280; margin-top: 0.5rem; text-align: center;">
                        <strong>Figure 2.</strong> M&ecirc;me vue en th&egrave;me ECDIS sombre avec rendu des cr&ecirc;tes de vagues. Le tableau de comparaison d&eacute;taille distance, carburant, temps, vitesse moyenne et nombre de waypoints pour la route de r&eacute;f&eacute;rence et la route optimis&eacute;e.
                    </figcaption>
                </figure>

                <p>
                    Le syst&egrave;me actuel fournit donc un routage A* fonctionnel avec m&eacute;t&eacute;o temporelle,
                    un mod&egrave;le de performance calibrable, et une quantification d&rsquo;incertitude par Monte
                    Carlo &mdash; mais sur une seule pr&eacute;vision, avec des param&egrave;tres scalaires de mer, et
                    dans un espace de trajectoires non structur&eacute;. Les trois probl&egrave;mes ouverts
                    identifi&eacute;s ci-dessous visent &agrave; lever ces trois limitations.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 2. PROBLÈME 1 : SCÉNARIOS MÉTÉOROLOGIQUES -->
            <!-- ============================================================ -->
            <section id="p1-diagnostic">
                <h2><i class="fas fa-cloud-sun"></i> 2. Probl&egrave;me 1 : l&rsquo;inad&eacute;quation des sc&eacute;narios m&eacute;t&eacute;orologiques</h2>

                <h3>2.1 Diagnostic</h3>
                <p>
                    Le routage m&eacute;t&eacute;orologique classique utilise une pr&eacute;vision d&eacute;terministe comme entr&eacute;e.
                    Cette pr&eacute;vision est fiable 3 &agrave; 5 jours pour les champs synoptiques [4], alors qu&rsquo;une
                    travers&eacute;e transoc&eacute;anique dure 10 &agrave; 20 jours. Au-del&agrave; de l&rsquo;horizon fiable, l&rsquo;optimiseur
                    exploite des gradients qui ne se mat&eacute;rialiseront pas.
                </p>
                <p>
                    L&rsquo;alternative &mdash; utiliser les ensembles num&eacute;riques (ECMWF ENS &agrave; 51 membres, GEFS &agrave;
                    31 membres) &mdash; ne r&eacute;sout pas le probl&egrave;me. Ces ensembles sont con&ccedil;us pour caract&eacute;riser
                    l&rsquo;incertitude atmosph&eacute;rique globale, non pour fournir des sc&eacute;narios exploitables au niveau
                    d&rsquo;une route maritime. Leurs membres ne sont pas ind&eacute;pendants, leur nombre est insuffisant pour
                    estimer les queues de distribution, et ils ne garantissent pas la coh&eacute;rence physique entre les
                    variables (un membre peut pr&eacute;senter un vent fort avec une mer plate, combinaison qui n&rsquo;existe
                    pas dans la r&eacute;alit&eacute;).
                </p>
                <p>
                    Une troisi&egrave;me approche consiste &agrave; &eacute;chantillonner des sc&eacute;narios &agrave; partir de distributions
                    param&eacute;triques ajust&eacute;es sur la climatologie (Weibull pour le vent, Rayleigh pour
                    \(H_s\), Von Mises pour les directions). Mais cette approche produit des
                    r&eacute;alisations statistiquement plausibles et m&eacute;t&eacute;orologiquement incoh&eacute;rentes : les
                    corr&eacute;lations spatio-temporelles entre variables ne sont pas captur&eacute;es par des distributions
                    marginales, m&ecirc;me coupl&eacute;es par une matrice de corr&eacute;lation.
                </p>

                <div class="alert warning">
                    <strong><i class="fas fa-exclamation-triangle"></i> Constat fondamental</strong><br>
                    Toutes ces approches traitent la m&eacute;t&eacute;o comme un bruit &agrave; caract&eacute;riser statistiquement,
                    alors qu&rsquo;elle est un ensemble de <em>situations</em> &agrave; identifier.
                </div>
            </section>


            <!-- ============================================================ -->
            <!-- 2.2 WASSERSTEIN -->
            <!-- ============================================================ -->
            <section id="p1-wasserstein">
                <h3>2.2 Approche propos&eacute;e : ensembles analogues et distance de Wasserstein</h3>

                <p>
                    Nous proposons de remplacer l&rsquo;&eacute;chantillonnage param&eacute;trique par une recherche d&rsquo;analogues
                    historiques dans les r&eacute;analyses ERA5 [9]. Le principe est simple : plut&ocirc;t que de g&eacute;n&eacute;rer
                    des sc&eacute;narios synth&eacute;tiques, on recherche dans 84 ans de donn&eacute;es (1940&ndash;2024) les situations
                    r&eacute;elles qui ressemblent &agrave; la pr&eacute;vision courante.
                </p>
                <p>
                    Chaque analogue est physiquement coh&eacute;rent par construction : il s&rsquo;est r&eacute;ellement produit.
                    Les corr&eacute;lations spatio-temporelles entre vent, vagues, courant et pression sont captur&eacute;es
                    implicitement, sans mod&eacute;lisation explicite. La m&eacute;thode des ensembles analogues (AnEn) est
                    &eacute;tablie en pr&eacute;vision m&eacute;t&eacute;orologique [12] ; son application au routage maritime, combin&eacute;e
                    &agrave; une m&eacute;trique de similarit&eacute; adapt&eacute;e, constitue l&rsquo;originalit&eacute; de cette proposition.
                </p>

                <h4>2.2.1 Pourquoi la similarit&eacute; spatio-temporelle est essentielle</h4>
                <p>
                    Un analogue doit correspondre non seulement &agrave; l&rsquo;&eacute;tat m&eacute;toc&eacute;anique moyen, mais aussi
                    &agrave; la g&eacute;ographie et &agrave; la dynamique temporelle de la situation. Une d&eacute;pression de 3 m de
                    \(H_s\) dans l&rsquo;oc&eacute;an Indien n&rsquo;a rien en commun avec une d&eacute;pression de m&ecirc;me amplitude en
                    Atlantique Nord : le fetch, les courants, la bathym&eacute;trie et le r&eacute;gime synoptique sont
                    enti&egrave;rement diff&eacute;rents. De m&ecirc;me, une mer de 3 m qui monte n&rsquo;est pas &eacute;quivalente &agrave; une
                    mer de 3 m qui descend : la premi&egrave;re annonce une d&eacute;t&eacute;rioration, la seconde une am&eacute;lioration.
                </p>
                <p>
                    La similarit&eacute; doit donc &ecirc;tre mesur&eacute;e sur une fen&ecirc;tre spatio-temporelle : typiquement une
                    zone de 200&times;200 milles nautiques sur 24 &agrave; 48 heures, qui capture la structure spatiale et
                    l&rsquo;&eacute;volution de la situation.
                </p>

                <h4>2.2.2 Choix de la distance de Wasserstein</h4>
                <p>
                    La distance de Wasserstein (ou <em>Earth Mover&rsquo;s Distance</em>) [10] mesure le co&ucirc;t de transport
                    optimal pour transformer une distribution empirique en une autre. Une fen&ecirc;tre m&eacute;t&eacute;o constitue
                    un nuage de points dans l&rsquo;espace \((H_s, T_p, u_{\text{vent}}, v_{\text{vent}}, p_{\text{atm}})\) ;
                    un analogue ERA5 constitue un autre nuage de points. La distance de Wasserstein quantifie combien
                    de &laquo; masse &raquo; il faut d&eacute;placer pour transformer l&rsquo;un en l&rsquo;autre.
                </p>
                <p>
                    Son avantage d&eacute;cisif est la tol&eacute;rance aux d&eacute;calages spatiaux : un champ de pression d&eacute;cal&eacute;
                    de 50 milles produit une erreur euclidienne importante alors que le patron m&eacute;t&eacute;orologique est
                    identique, simplement d&eacute;plac&eacute;. La distance de Wasserstein capte cette proximit&eacute; structurelle.
                    La distance de Mahalanobis suppose des distributions gaussiennes, hypoth&egrave;se discutable pour
                    \(H_s\) et pour les directions circulaires. Le <em>Dynamic Time Warping</em> g&egrave;re les
                    d&eacute;calages temporels mais est unidimensionnel.
                </p>
                <p>
                    Les variables angulaires sont transform&eacute;es via \(\theta \to (\cos\theta, \sin\theta)\). Le co&ucirc;t
                    de calcul, en \(O(n^3)\) exact, est ramen&eacute; &agrave; un niveau tractable par les solveurs r&eacute;gularis&eacute;s
                    (Sinkhorn-Knopp) [11] apr&egrave;s pr&eacute;-filtrage g&eacute;ographique et saisonnier.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 2.2.3 PIPELINE & CLUSTERING -->
            <!-- ============================================================ -->
            <section id="p1-pipeline">
                <h4>2.2.3 Pipeline de s&eacute;lection et clustering</h4>

                <p>La s&eacute;lection proc&egrave;de en quatre &eacute;tapes :</p>

                <table>
                    <thead>
                        <tr>
                            <th>&Eacute;tape</th>
                            <th>M&eacute;thode</th>
                            <th>R&eacute;duction</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td><strong>1. Pr&eacute;-filtrage</strong></td>
                            <td>Masque par zone g&eacute;ographique et saison (&plusmn;1 mois)</td>
                            <td>~750 000 &rarr; ~60 000</td>
                        </tr>
                        <tr>
                            <td><strong>2. Criblage rapide</strong></td>
                            <td>Distance euclidienne sur les scalaires moyenn&eacute;s (\(H_s\) moyen, vent moyen, pression moyenne)</td>
                            <td>~60 000 &rarr; ~500</td>
                        </tr>
                        <tr>
                            <td><strong>3. Classement fin</strong></td>
                            <td>Distance de Wasserstein sur les distributions multivari&eacute;es spatio-temporelles compl&egrave;tes</td>
                            <td>~500 &rarr; <em>K</em> = 50&ndash;100</td>
                        </tr>
                        <tr>
                            <td><strong>4. Clustering</strong></td>
                            <td>Regroupement des <em>K</em> analogues en familles de sc&eacute;narios (<em>k</em>-means ou HDBSCAN)</td>
                            <td><em>K</em> &rarr; 3&ndash;5 sc&eacute;narios</td>
                        </tr>
                    </tbody>
                </table>

                <p>
                    Chaque cluster repr&eacute;sente un type d&rsquo;&eacute;volution m&eacute;t&eacute;orologique : &laquo; d&eacute;pression passant
                    au nord &raquo;, &laquo; d&eacute;pression passant au sud &raquo;, &laquo; anticyclone persistant &raquo;, etc.
                    Les clusters sont pond&eacute;r&eacute;s par fr&eacute;quence historique, ajust&eacute;e par proximit&eacute; Wasserstein
                    &agrave; la pr&eacute;vision courante.
                </p>

                <div class="alert success">
                    <strong><i class="fas fa-check-circle"></i> R&eacute;sultat</strong><br>
                    Le navigateur ne re&ccedil;oit plus une pr&eacute;vision unique, mais une carte de 3 &agrave; 5 situations
                    plausibles, identifi&eacute;es, nommables et compr&eacute;hensibles, chacune assortie d&rsquo;une probabilit&eacute;.
                </div>
            </section>


            <!-- ============================================================ -->
            <!-- 2.2.4 MONTE CARLO CONDITIONNEL -->
            <!-- ============================================================ -->
            <section id="p1-monte-carlo">
                <h4>2.2.4 Simulations de Monte Carlo param&eacute;triques conditionnelles</h4>

                <p>
                    Le clustering fournit la structure ; il reste &agrave; explorer la variabilit&eacute; intra-sc&eacute;nario.
                    Pour chaque cluster, les distributions des variables m&eacute;toc&eacute;aniques sont ajust&eacute;es
                    param&eacute;triquement &mdash; Weibull pour la vitesse du vent, Rayleigh pour \(H_s\), Von Mises
                    pour les directions &mdash; conditionnellement au sc&eacute;nario identifi&eacute;. On &eacute;chantillonne ensuite
                    des milliers de r&eacute;alisations (\(N\) = 1 000 &agrave; 10 000) &agrave; l&rsquo;int&eacute;rieur de chaque cluster.
                </p>
                <p>
                    Cette approche combine les avantages des deux mondes :
                </p>
                <ul>
                    <li>
                        <strong>Les analogues</strong> fournissent la coh&eacute;rence physique inter-variables et la structure
                        spatio-temporelle : les corr&eacute;lations vent&ndash;vagues&ndash;courant&ndash;pression sont celles de
                        situations r&eacute;elles, pas d&rsquo;un mod&egrave;le de corr&eacute;lation.
                    </li>
                    <li>
                        <strong>Le param&eacute;trique</strong> fournit la puissance d&rsquo;&eacute;chantillonnage n&eacute;cessaire pour
                        estimer les queues de distribution et les intervalles de confiance, ce que 50 &agrave; 100 analogues
                        seuls ne permettent pas.
                    </li>
                </ul>
                <p>
                    Chaque r&eacute;alisation Monte Carlo est propag&eacute;e &agrave; travers le mod&egrave;le de performance calibr&eacute;
                    (section 3) pour produire une estimation de consommation. Le r&eacute;sultat, par sc&eacute;nario, n&rsquo;est
                    pas un chiffre mais une distribution : &laquo; 430&ndash;460 t &agrave; 90 % de confiance &raquo; plut&ocirc;t que
                    &laquo; 452 t &raquo;.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 3. PROBLÈME 2 : CALIBRATION SPECTRALE -->
            <!-- ============================================================ -->
            <section id="p2-diagnostic">
                <h2><i class="fas fa-water"></i> 3. Probl&egrave;me 2 : la calibration du mod&egrave;le hydrodynamique par reconstitution spectrale</h2>

                <h3>3.1 Diagnostic</h3>
                <p>
                    Les mod&egrave;les de r&eacute;sistance ajout&eacute;e en vagues &mdash; Stawave-1/2 [8], Liu&ndash;Papanikolaou [6],
                    formulations issues de Holtrop&ndash;Mennen [7] &mdash; pr&eacute;disent la perte de vitesse et la
                    surconsommation en fonction de param&egrave;tres scalaires d&rsquo;&eacute;tat de mer : hauteur significative
                    \(H_s\), p&eacute;riode pic \(T_p\), direction moyenne de la houle. Ces mod&egrave;les sont calibr&eacute;s
                    sur des essais en bassin ou des campagnes de mesure en conditions contr&ocirc;l&eacute;es.
                </p>
                <p>
                    En exploitation r&eacute;elle, l&rsquo;&eacute;cart entre ces pr&eacute;dictions et le comportement observ&eacute; du navire
                    peut &ecirc;tre consid&eacute;rable, pour deux raisons.
                </p>
                <p>
                    <strong>D&rsquo;abord, les param&egrave;tres scalaires ne d&eacute;crivent pas la mer.</strong> Un spectre &agrave; deux pics
                    (houle longue de secteur + mer du vent de travers), fr&eacute;quent dans l&rsquo;Atlantique, produit des
                    sollicitations tr&egrave;s diff&eacute;rentes d&rsquo;un spectre unimodal de m&ecirc;me \(H_s\) : les ph&eacute;nom&egrave;nes
                    de roulis param&eacute;trique, de slamming ou de r&eacute;sonance d&eacute;pendent de la structure spectrale, pas
                    de ses moyennes.
                </p>
                <p>
                    <strong>Ensuite, les conditions du navire en exploitation s&rsquo;&eacute;cartent des conditions d&rsquo;essai :</strong>
                    fouling biologique [5], tirant d&rsquo;eau et assiette variables, vieillissement m&eacute;canique. L&rsquo;erreur
                    cumul&eacute;e &mdash; simplification spectrale plus &eacute;cart &eacute;tat du navire &mdash; peut atteindre plusieurs
                    pourcents de la consommation, soit l&rsquo;ordre de grandeur du gain attendu du routage.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 3.2 RECONSTITUTION SPECTRALE -->
            <!-- ============================================================ -->
            <section id="p2-spectre">
                <h3>3.2 Approche propos&eacute;e : reconstitution spectrale et calibration</h3>
                <p>
                    Pour r&eacute;duire cet &eacute;cart, nous proposons d&rsquo;utiliser le spectre directionnel de vagues
                    reconstruit &agrave; partir des mesures disponibles &agrave; bord &mdash; acc&eacute;l&eacute;rom&egrave;tres, inclinomètres,
                    &eacute;ventuellement radar bande X (type Wavex/Miros) &mdash; pour calibrer en continu les param&egrave;tres
                    du mod&egrave;le hydrodynamique.
                </p>

                <h4>3.2.1 Du spectre aux descripteurs</h4>
                <p>
                    Le spectre directionnel \(S(f, \theta)\) est projet&eacute; sur un ensemble de descripteurs qui
                    caract&eacute;risent l&rsquo;&eacute;tat de mer de mani&egrave;re plus riche que les seuls scalaires
                    \((H_s, T_p)\) :
                </p>
                <ul>
                    <li>Hauteur significative et p&eacute;riode pic par syst&egrave;me de houle (d&eacute;composition en partitions spectrales)</li>
                    <li>Directions dominantes de chaque partition</li>
                    <li>Largeur directionnelle (<em>spreading</em>)</li>
                    <li>Indicateur de multi-pic (nombre et s&eacute;paration des syst&egrave;mes)</li>
                    <li>Angle relatif de chaque syst&egrave;me par rapport au cap du navire</li>
                </ul>
                <p>
                    Ces descripteurs constituent le vecteur d&rsquo;entr&eacute;e du mod&egrave;le de performance.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 3.2.2 CALIBRATION -->
            <!-- ============================================================ -->
            <section id="p2-calibration">
                <h4>3.2.2 Calibration du mod&egrave;le de performance</h4>
                <p>
                    Les mesures simultan&eacute;es de vitesse sur l&rsquo;eau (loch), vitesse fond (GPS), puissance propulsive
                    (couple-m&egrave;tre ou consommation instantan&eacute;e) et &eacute;tat de chargement permettent de calibrer la
                    relation :
                </p>

                <div class="formula-block">
                    <div class="formula-title">Mod&egrave;le de perte de vitesse</div>
                    \[
                    \Delta V = f\!\left(H_s^{(i)},\; T_p^{(i)},\; \theta_{\text{rel}}^{(i)},\; \text{&eacute;tat navire} ;\; \boldsymbol{\alpha}\right)
                    \]
                    <div class="formula-where">
                        o&ugrave; \(\Delta V\) est la perte de vitesse observ&eacute;e, l&rsquo;exposant \((i)\) indexe les partitions
                        spectrales, et \(\boldsymbol{\alpha}\) est le vecteur de param&egrave;tres &agrave; calibrer (coefficients de
                        r&eacute;sistance ajout&eacute;e, seuils de r&eacute;duction, domaines de r&eacute;sonance).
                    </div>
                </div>

                <p>
                    La calibration peut &ecirc;tre formul&eacute;e comme un probl&egrave;me d&rsquo;estimation de param&egrave;tres (moindres
                    carr&eacute;s non lin&eacute;aires) ou d&rsquo;apprentissage supervis&eacute; (for&ecirc;t al&eacute;atoire, r&eacute;seau de neurones
                    peu profond), selon la quantit&eacute; de donn&eacute;es disponibles et le degr&eacute; de physique que l&rsquo;on
                    souhaite conserver dans le mod&egrave;le.
                </p>

                <h4>3.2.3 Boucle de r&eacute;troaction</h4>
                <p>
                    Le mod&egrave;le calibr&eacute; &eacute;volue dans le temps : chaque voyage fournit de nouvelles observations qui
                    affinent les param&egrave;tres. En particulier, la d&eacute;gradation progressive de la coque par fouling
                    entre deux passages en cale s&egrave;che se traduit par une d&eacute;rive d&eacute;tectable des coefficients de
                    r&eacute;sistance, ce qui fournit un indicateur indirect de l&rsquo;&eacute;tat de la car&egrave;ne.
                </p>
                <p>
                    L&rsquo;objectif n&rsquo;est pas de remplacer les mod&egrave;les hydrodynamiques &eacute;tablis, mais de les corriger
                    empiriquement pour le navire r&eacute;el dans ses conditions d&rsquo;exploitation r&eacute;elles. Le mod&egrave;le
                    ainsi calibr&eacute; alimente ensuite les simulations de consommation sous les diff&eacute;rents sc&eacute;narios
                    m&eacute;t&eacute;orologiques issus du clustering (section 2).
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 4. PROBLÈME 3 : INSTABILITÉ DES TRAJECTOIRES -->
            <!-- ============================================================ -->
            <section id="p3-diagnostic">
                <h2><i class="fas fa-route"></i> 4. Probl&egrave;me 3 : l&rsquo;instabilit&eacute; des trajectoires optimales</h2>

                <h3>4.1 Diagnostic</h3>
                <p>
                    M&ecirc;me avec un mod&egrave;le navire calibr&eacute; et des sc&eacute;narios m&eacute;t&eacute;orologiques pertinents,
                    l&rsquo;optimisation de route reste un probl&egrave;me mal pos&eacute; au sens o&ugrave; l&rsquo;espace des trajectoires
                    stochastiques est d&eacute;pourvu de structure r&eacute;guli&egrave;re exploitable.
                </p>
                <p>
                    Chaque sc&eacute;nario m&eacute;t&eacute;orologique produit un champ de co&ucirc;ts diff&eacute;rent. La route optimale
                    dans un champ donn&eacute; n&rsquo;a, en g&eacute;n&eacute;ral, aucune proximit&eacute; g&eacute;ographique avec la route optimale
                    dans un champ voisin. L&rsquo;espace des trajets possibles n&rsquo;est pas un espace vectoriel lisse :
                    c&rsquo;est un ensemble de chemins al&eacute;atoires dans un champ de co&ucirc;ts lui-m&ecirc;me al&eacute;atoire. La
                    fonction de co&ucirc;t est hautement non convexe, non lisse, avec de multiples minima locaux.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 4.2 ÉCHEC DE PARETO -->
            <!-- ============================================================ -->
            <section id="p3-pareto">
                <h3>4.2 &Eacute;chec de l&rsquo;optimisation de Pareto</h3>
                <p>
                    Une optimisation multi-objectif de type Pareto (temps vs. carburant vs. risque) dans cet espace
                    produit un front fragment&eacute; : de faibles variations de pond&eacute;ration entre crit&egrave;res entra&icirc;nent
                    des sauts topologiques importants dans l&rsquo;espace des routes. Des routes g&eacute;ographiquement tr&egrave;s
                    diff&eacute;rentes correspondent &agrave; des gains marginaux sur un crit&egrave;re. D&rsquo;une r&eacute;-optimisation &agrave;
                    l&rsquo;autre (par exemple toutes les 24 heures), les solutions propos&eacute;es peuvent &ecirc;tre radicalement
                    diff&eacute;rentes.
                </p>
                <p>
                    Ces comportements sont incompatibles avec l&rsquo;exploitation op&eacute;rationnelle. Le capitaine a besoin
                    d&rsquo;une route stable, compr&eacute;hensible, qui &eacute;volue de mani&egrave;re pr&eacute;visible au fil des mises &agrave; jour.
                    Le front de Pareto expose des compromis th&eacute;oriques mais ne fournit pas de base de d&eacute;cision
                    exploitable.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 4.3 SPLINES CONTRAINTES -->
            <!-- ============================================================ -->
            <section id="p3-splines">
                <h3>4.3 Approche propos&eacute;e : splines contraintes &agrave; enveloppe exponentielle</h3>

                <p>
                    Nous proposons d&rsquo;abandonner la recherche d&rsquo;un front de Pareto global et de param&eacute;trer la route
                    sous la forme d&rsquo;une B-spline cubique d&eacute;finie par un nombre r&eacute;duit de points de contr&ocirc;le
                    (\(N_c\) = 4 &agrave; 8) autour d&rsquo;une route de r&eacute;f&eacute;rence \(\mathbf{x}_{\text{ref}}(t)\) (route
                    orthodromique ou plan de voyage initial).
                </p>
                <p>
                    Les points de contr&ocirc;le sont les seules variables d&rsquo;optimisation. La spline garantit par
                    construction la continuit&eacute; de courbure (classe \(C^2\)), &eacute;liminant les artefacts de zigzag
                    sans recours &agrave; des p&eacute;nalit&eacute;s arbitraires.
                </p>

                <h4>4.3.1 Enveloppe &agrave; d&eacute;croissance exponentielle</h4>
                <p>
                    L&rsquo;&eacute;cart lat&eacute;ral maximal &agrave; la route de r&eacute;f&eacute;rence est contraint par :
                </p>

                <div class="formula-block">
                    <div class="formula-title">Couloir exponentiel</div>
                    \[
                    \Delta_{\max}(t) = \Delta_0 \, e^{-t/\tau}
                    \]
                    <div class="formula-where">
                        o&ugrave; \(\Delta_0\) est la largeur initiale du couloir (50 &agrave; 80 milles nautiques pour une travers&eacute;e
                        atlantique) et \(\tau\) est la constante de d&eacute;croissance, interpr&eacute;table comme le temps de
                        d&eacute;corr&eacute;lation de la pr&eacute;vision m&eacute;t&eacute;orologique.
                    </div>
                </div>

                <p>La contrainte s&rsquo;&eacute;crit :</p>

                <div class="formula-block">
                    <div class="formula-title">Contrainte de couloir</div>
                    \[
                    \left\|\mathbf{x}(t;\boldsymbol{\theta}) - \mathbf{x}_{\text{ref}}(t)\right\| \leq \Delta_0 \, e^{-t/\tau}
                    \quad \forall\, t \in [0, T]
                    \]
                </div>

                <div class="alert info">
                    <strong><i class="fas fa-anchor"></i> Interpr&eacute;tation physique</strong><br>
                    Au d&eacute;but du voyage, la pr&eacute;vision offre un signal exploitable pour d&eacute;vier de la route directe
                    (contourner une d&eacute;pression, exploiter un courant). &Agrave; mesure que l&rsquo;horizon augmente,
                    l&rsquo;incertitude cro&icirc;t et la route directe redevient la meilleure r&eacute;f&eacute;rence en l&rsquo;absence de
                    signal robuste. En fin de voyage, l&rsquo;information m&eacute;t&eacute;orologique &agrave; longue &eacute;ch&eacute;ance n&rsquo;est
                    plus fiable et le couloir se referme : la route directe est la meilleure route.
                </div>

                <h4>4.3.2 Propri&eacute;t&eacute;s</h4>
                <p>
                    La combinaison spline + enveloppe &eacute;limine les sauts topologiques : l&rsquo;espace de param&egrave;tres est
                    de faible dimension (\(2N_c\) variables) et le couloir born&eacute; assure que deux solutions voisines
                    en param&egrave;tres sont voisines g&eacute;ographiquement. La r&eacute;-optimisation en cours de voyage produit
                    des &eacute;volutions progressives de la route, jamais de changement radical.
                </p>
                <p>
                    Le cadre se combine naturellement avec une strat&eacute;gie de commande pr&eacute;dictive &agrave; horizon glissant
                    (MPC) : &agrave; chaque cycle, le couloir se r&eacute;ouvre &agrave; la position actuelle avec les pr&eacute;visions
                    mises &agrave; jour. En restreignant l&rsquo;espace de recherche par la g&eacute;om&eacute;trie, on revient &agrave; un
                    crit&egrave;re scalaire unique (carburant ou temps) pour chaque sc&eacute;nario, sans les artefacts de la
                    fragmentation Pareto.
                </p>

                <h4>4.3.3 Calibration</h4>
                <p>
                    Le param&egrave;tre \(\tau\) se calibre empiriquement en comparant l&rsquo;erreur de pr&eacute;vision en
                    fonction du d&eacute;lai sur un historique ERA5&ndash;ECMWF ou ERA5&ndash;GFS, par bassin et par saison.
                    Typiquement, \(\tau \approx\) 72&ndash;96 heures pour l&rsquo;Atlantique Nord en hiver. Le nombre de points
                    de contr&ocirc;le \(N_c\) a une interpr&eacute;tation op&eacute;rationnelle directe : le nombre de changements de
                    cap significatifs autoris&eacute;s sur la travers&eacute;e.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 5. ARTICULATION DES TROIS APPROCHES -->
            <!-- ============================================================ -->
            <section id="articulation">
                <h2><i class="fas fa-project-diagram"></i> 5. Articulation des trois approches</h2>

                <p>
                    Les trois propositions op&egrave;rent dans des espaces diff&eacute;rents mais se combinent en un pipeline
                    coh&eacute;rent.
                </p>
                <p>
                    <strong>Le clustering de sc&eacute;narios</strong> (probl&egrave;me 1) structure l&rsquo;espace des situations
                    m&eacute;t&eacute;orologiques. Il transforme un continuum de pr&eacute;visions bruit&eacute;es en un nombre r&eacute;duit
                    de situations-types, chacune assortie d&rsquo;une probabilit&eacute;. Les <strong>simulations de Monte Carlo
                    param&eacute;triques</strong>, conditionnelles &agrave; chaque cluster, explorent la variabilit&eacute; intra-sc&eacute;nario
                    et produisent des distributions de variables m&eacute;toc&eacute;aniques.
                </p>
                <p>
                    <strong>La calibration spectrale</strong> (probl&egrave;me 2) produit un mod&egrave;le de performance fid&egrave;le au
                    navire r&eacute;el. Chaque r&eacute;alisation Monte Carlo est propag&eacute;e &agrave; travers ce mod&egrave;le calibr&eacute; pour
                    produire une distribution de consommation par sc&eacute;nario &mdash; non un chiffre, mais un intervalle
                    de confiance.
                </p>
                <p>
                    <strong>Les splines contraintes</strong> (probl&egrave;me 3) structurent l&rsquo;espace des routes &agrave; l&rsquo;int&eacute;rieur
                    de chaque sc&eacute;nario, en produisant des trajectoires lisses, stables et g&eacute;ographiquement r&eacute;alistes.
                </p>
                <p>Le flux complet s&rsquo;&eacute;crit :</p>

                <div class="alert info" style="text-align: center; font-size: 0.9rem;">
                    Analogues ERA5 &rarr; Clustering Wasserstein &rarr; Monte Carlo param&eacute;trique conditionnel &times; Mod&egrave;le calibr&eacute; spectralement &rarr; Distributions de consommation par sc&eacute;nario &rarr; Routes spline contraintes &rarr; Tableau de bord pour le capitaine
                </div>

                <h3>Exemple de sortie op&eacute;rationnelle</h3>

                <p>Le navigateur re&ccedil;oit un tableau de bord structur&eacute; :</p>

                <table>
                    <thead>
                        <tr>
                            <th>Sc&eacute;nario</th>
                            <th>Probabilit&eacute;</th>
                            <th>Consommation (IC 90 %)</th>
                            <th>ETA</th>
                            <th>Route</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td><strong>A</strong> &mdash; D&eacute;pression passant au nord</td>
                            <td>55 %</td>
                            <td>430&ndash;460 t (m&eacute;d. 443 t)</td>
                            <td>+2 h</td>
                            <td>D&eacute;viation sud de 35 NM les 48 premi&egrave;res heures, puis convergence vers le grand cercle</td>
                        </tr>
                        <tr>
                            <td><strong>B</strong> &mdash; D&eacute;pression passant au sud</td>
                            <td>30 %</td>
                            <td>460&ndash;510 t</td>
                            <td>+6 h</td>
                            <td>Maintien du grand cercle, r&eacute;duction de vitesse &agrave; partir de J+2</td>
                        </tr>
                        <tr>
                            <td><strong>C</strong> &mdash; Anticyclone persistant</td>
                            <td>15 %</td>
                            <td>390&ndash;420 t</td>
                            <td>&minus;3 h</td>
                            <td>Grand cercle, vitesse &eacute;conomique</td>
                        </tr>
                    </tbody>
                </table>

                <p>
                    Pour chaque sc&eacute;nario, les hypoth&egrave;ses du mod&egrave;le, les incertitudes de la pr&eacute;vision et les
                    limites de la calibration sont expos&eacute;es. Le capitaine arbitre entre les sc&eacute;narios en fonction
                    de ses propres crit&egrave;res : marge d&rsquo;ETA, confort de l&rsquo;&eacute;quipage, &eacute;tat du navire, consignes de
                    l&rsquo;armement.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 6. DISCUSSION -->
            <!-- ============================================================ -->
            <section id="discussion">
                <h2><i class="fas fa-comments"></i> 6. Discussion</h2>

                <h3>6.1 Positionnement</h3>
                <p>
                    Le routage par graphe (VISIR-2 [13], Dijkstra modifi&eacute;) et par isochrones produit des solutions
                    de qualit&eacute; mais ne traite ni la s&eacute;lection de sc&eacute;narios ni la confiance d&eacute;croissante dans la
                    pr&eacute;vision. La m&eacute;thode AnEn est &eacute;tablie en m&eacute;t&eacute;orologie [12] mais n&rsquo;a pas, &agrave; notre
                    connaissance, &eacute;t&eacute; combin&eacute;e avec une m&eacute;trique de Wasserstein spatio-temporelle pour le routage
                    maritime. La calibration de mod&egrave;les hydrodynamiques par donn&eacute;es op&eacute;rationnelles fait l&rsquo;objet
                    de travaux r&eacute;cents [14] mais reste rarement coupl&eacute;e &agrave; l&rsquo;optimisation de route.
                </p>

                <h3>6.2 Limites</h3>
                <p>
                    Le cadre repose sur l&rsquo;hypoth&egrave;se de quasi-ergodicit&eacute; : les situations pass&eacute;es (ERA5,
                    1940&ndash;2024) sont repr&eacute;sentatives des situations futures, conditionnellement &agrave; la zone et &agrave;
                    la saison. Cette hypoth&egrave;se est raisonnable &agrave; moyen terme mais discutable sous l&rsquo;effet du
                    changement climatique.
                </p>
                <p>
                    La reconstitution spectrale d&eacute;pend de la qualit&eacute; et de la disponibilit&eacute; des capteurs &agrave; bord.
                    Sans radar bande X d&eacute;di&eacute; (type Miros Wavex), la reconstitution repose sur les
                    acc&eacute;l&eacute;rom&egrave;tres et inclinom&egrave;tres, dont la bande passante et la r&eacute;solution limitent la
                    qualit&eacute; du spectre directionnel reconstruit.
                </p>
                <p>
                    Le pipeline de s&eacute;lection d&rsquo;analogues introduit plusieurs hyperparamètres (taille de la fen&ecirc;tre,
                    nombre de clusters, seuils) qui n&eacute;cessitent une validation sur des cas historiques document&eacute;s.
                </p>

                <h3>6.3 Philosophie d&rsquo;emploi</h3>

                <div class="alert warning">
                    <strong><i class="fas fa-compass"></i> Principe directeur</strong><br>
                    Ce cadre n&rsquo;est pas con&ccedil;u comme un syst&egrave;me d&rsquo;optimisation automatique. Il est con&ccedil;u
                    comme un outil d&rsquo;analyse qui fournit aux navigateurs les moyens de comprendre les situations
                    m&eacute;t&eacute;orologiques possibles, leurs cons&eacute;quences sur la consommation et les routes, et les
                    incertitudes associ&eacute;es. L&rsquo;arbitrage reste humain.
                </div>

                <p style="font-style: italic; text-align: center; margin: 2rem 0; font-size: 1.05rem; color: var(--ib-navy);">
                    Un syst&egrave;me de routage honn&ecirc;te est, avant tout, un syst&egrave;me qui montre ce qu&rsquo;il ne sait pas.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- 7. CONCLUSION -->
            <!-- ============================================================ -->
            <section id="conclusion">
                <h2><i class="fas fa-flag-checkered"></i> 7. Conclusion</h2>

                <p>
                    Le routage m&eacute;t&eacute;orologique en marine marchande est confront&eacute; &agrave; trois probl&egrave;mes fondamentaux :
                    l&rsquo;inad&eacute;quation des sc&eacute;narios m&eacute;t&eacute;orologiques g&eacute;n&eacute;riques, l&rsquo;&eacute;cart entre les mod&egrave;les
                    de performance et le comportement r&eacute;el du navire, et l&rsquo;absence de structure exploitable dans
                    l&rsquo;espace des trajectoires stochastiques. Ces trois probl&egrave;mes sont de natures diff&eacute;rentes
                    &mdash; statistique, physique, math&eacute;matique &mdash; mais convergent vers une m&ecirc;me cons&eacute;quence :
                    les syst&egrave;mes de routage actuels produisent des r&eacute;sultats dont la pr&eacute;cision apparente masque
                    des incertitudes consid&eacute;rables.
                </p>
                <p>
                    Les approches propos&eacute;es &mdash; clustering d&rsquo;analogues par distance de Wasserstein, simulations de
                    Monte Carlo param&eacute;triques conditionnelles, calibration spectrale du mod&egrave;le navire, et splines
                    contraintes &agrave; enveloppe exponentielle &mdash; ne pr&eacute;tendent pas &eacute;liminer ces incertitudes. Elles
                    visent &agrave; les structurer, les quantifier et les rendre visibles au d&eacute;cideur.
                </p>
                <p>
                    La conclusion de ce travail est que la meilleure approche du routage m&eacute;t&eacute;orologique n&rsquo;est pas
                    d&rsquo;automatiser la d&eacute;cision de route, mais de fournir aux navigateurs les outils d&rsquo;analyse
                    n&eacute;cessaires &mdash; sc&eacute;narios identifi&eacute;s et probabilis&eacute;s, mod&egrave;le de performance calibr&eacute; sur
                    le navire r&eacute;el, espace de d&eacute;cision d&eacute;limit&eacute; et stable &mdash; pour qu&rsquo;ils effectuent eux-m&ecirc;mes
                    des arbitrages &eacute;clair&eacute;s. Le r&ocirc;le de l&rsquo;algorithme est de structurer l&rsquo;information, non de se
                    substituer au jugement du capitaine.
                </p>
            </section>


            <!-- ============================================================ -->
            <!-- REFERENCES -->
            <!-- ============================================================ -->
            <section id="references">
                <h2><i class="fas fa-bookmark"></i> R&eacute;f&eacute;rences</h2>

                <ol>
                    <li>
                        Zis, T.P.V., North, R.J., Angeloudis, P., Ochieng, W.A., and Bell, M.G.H. (2020).
                        &ldquo;Evaluation of weather routing in reducing fuel consumption and CO2 emissions.&rdquo;
                        <em>Transportation Research Part D: Transport and Environment</em>, 81:102265.
                    </li>
                    <li>
                        Walther, L., Rizvanolli, A., Wendebourg, M., and Jahn, C. (2016).
                        &ldquo;Modeling and optimization algorithms in ship weather routing.&rdquo;
                        <em>International Journal of e-Navigation and Maritime Economy</em>, 4:31&ndash;45.
                    </li>
                    <li>
                        Lu, R., Turan, O., Boulougouris, E., Banks, C., and Incecik, A. (2015).
                        &ldquo;A semi-empirical ship operational performance prediction model for voyage optimization towards energy efficient shipping.&rdquo;
                        <em>Ocean Engineering</em>, 110:18&ndash;28.
                    </li>
                    <li>
                        Bauer, P., Thorpe, A., and Brunet, G. (2015).
                        &ldquo;The quiet revolution of numerical weather prediction.&rdquo;
                        <em>Nature</em>, 525(7567):47&ndash;55.
                    </li>
                    <li>
                        Schultz, M.P. (2007).
                        &ldquo;Effects of coating roughness and biofouling on ship resistance and powering.&rdquo;
                        <em>Biofouling</em>, 23(5):331&ndash;341.
                    </li>
                    <li>
                        Liu, S. and Papanikolaou, A. (2016).
                        &ldquo;Fast approach to the estimation of the added resistance of ships in head waves.&rdquo;
                        <em>Ocean Engineering</em>, 112:211&ndash;225.
                    </li>
                    <li>
                        Holtrop, J. and Mennen, G.G.J. (1982).
                        &ldquo;An approximate power prediction method.&rdquo;
                        <em>International Shipbuilding Progress</em>, 29(335):166&ndash;170.
                    </li>
                    <li>
                        IMO (2012).
                        &ldquo;Interim Guidelines for the Calculation of the Coefficient fw for Decrease of Ship Speed in a Representative Sea Condition.&rdquo;
                        MEPC.1/Circ.796 (STAWAVE-1/2).
                    </li>
                    <li>
                        Hersbach, H. et al. (2020).
                        &ldquo;The ERA5 global reanalysis.&rdquo;
                        <em>Quarterly Journal of the Royal Meteorological Society</em>, 146(730):1999&ndash;2049.
                    </li>
                    <li>
                        Villani, C. (2009).
                        <em>Optimal Transport: Old and New.</em>
                        Grundlehren der mathematischen Wissenschaften, Vol. 338. Springer-Verlag.
                    </li>
                    <li>
                        Cuturi, M. (2013).
                        &ldquo;Sinkhorn Distances: Lightspeed Computation of Optimal Transport.&rdquo;
                        <em>Advances in Neural Information Processing Systems</em>, 26:2292&ndash;2300.
                    </li>
                    <li>
                        Delle Monache, L. et al. (2013).
                        &ldquo;Probabilistic Weather Prediction with an Analog Ensemble.&rdquo;
                        <em>Monthly Weather Review</em>, 141(10):3498&ndash;3516.
                    </li>
                    <li>
                        Mannarini, G., Pinardi, N., Coppini, G., Oddo, P., and Iafrati, A. (2016).
                        &ldquo;VISIR-I: small vessel &mdash; Loss estimates and route optimization.&rdquo;
                        <em>Journal of Marine Science and Engineering</em>, 4(2):36.
                    </li>
                    <li>
                        Nielsen, U.D. (2017).
                        &ldquo;A concise account of techniques available for shipboard sea state estimation.&rdquo;
                        <em>Ocean Engineering</em>, 129:352&ndash;362.
                    </li>
                </ol>
            </section>

        </div>
    </main>

</div>

<!-- Footer -->
<footer class="docs-footer">
    <p>&copy; 2026 WindMar. Apache License 2.0.</p>
    <p>
        <a href="https://github.com/windmar-nav/windmar" target="_blank"><i class="fab fa-github"></i> GitHub</a>
        &nbsp;|&nbsp;
        <a href="docs.html">Main Documentation</a>
        &nbsp;|&nbsp;
        <a href="https://slmar.co">slmar.co</a>
    </p>
</footer>

<!-- Sidebar active state script -->
<script>
    document.addEventListener('DOMContentLoaded', function() {
        const sections = document.querySelectorAll('section[id]');
        const navLinks = document.querySelectorAll('.sidebar-menu a[href^="#"]');

        function setActiveLink() {
            let current = '';
            sections.forEach(function(section) {
                const sectionTop = section.offsetTop - 100;
                if (window.scrollY >= sectionTop) {
                    current = section.getAttribute('id');
                }
            });

            navLinks.forEach(function(link) {
                link.classList.remove('active');
                if (link.getAttribute('href') === '#' + current) {
                    link.classList.add('active');
                }
            });
        }

        window.addEventListener('scroll', setActiveLink);
        setActiveLink();
    });
</script>

<script>
    document.addEventListener('DOMContentLoaded', function() {
        renderMathInElement(document.body, {
            delimiters: [
                {left: '\\[', right: '\\]', display: true},
                {left: '\\(', right: '\\)', display: false}
            ],
            throwOnError: false
        });
    });
</script>

</body>
</html>
